{"meta":{"title":"Hexo","subtitle":null,"description":null,"author":"令夕","url":"http://yoursite.com","root":"/"},"pages":[{"title":"这是自我介绍的题目","date":"2019-06-01T08:54:31.000Z","updated":"2019-06-01T08:54:55.313Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"这是一段自我介绍"}],"posts":[{"title":"（一）成功学的秘密","slug":"墨菲定理/（一）成功学的秘密","date":"2019-06-01T11:54:40.000Z","updated":"2019-06-01T12:11:52.086Z","comments":true,"path":"2019/06/01/墨菲定理/（一）成功学的秘密/","link":"","permalink":"http://yoursite.com/2019/06/01/墨菲定理/（一）成功学的秘密/","excerpt":"","text":"洛克定律：确定目标，专注行动 有目标才会成功 除非你清楚自己要到哪里去，否则你永远也到不了自己想去的地方。 古希腊彼得斯说：“须有人生的目标，否则精力全属浪费。” 古罗马小塞涅卡说：“有些人活着没有任何目标，他们在世间行走，就像河中一颗小草，他们不是行走，而是随波逐流。” 在这个世界上有这样一种现象，那就是“没有目标的人在为有目标的人达到目标”。 博恩崔西说：“成功就是目标的达成，其他都是这句话的注解”。 目标要“跳一跳，够得着” 目标不是越大也好，越高越棒，而是根据自己的实际情况，制定出切实可行的目标才有效。这个目标不能太容易就能达到，也不能高到永远也碰不着，“跳一跳，够得着”最好。 千里之行始于足下，汪洋大海积于滴水。成功都是一步一步走出来的。当然也有人一页暴富，一下成名，但又有谁能看到他们之前的努力与艰辛。在俄国著名生物学家巴普洛夫临终前，有人向他请教成功的秘诀。巴浦洛夫值说了八个字：“要热诚而且慢慢来”。“热诚”，有持久的兴趣才能坚持到成功。“慢慢来”，不要急于求成，做自己力所能及的事情，然后不断提高自己：不要妄想一步登天，要为自己定一个切实可行的目标，有挑战又能达到，不断追求，走向成功。 瓦拉赫效应：成功，要懂得经营自己的长处 经营自己的长处，让人生增值 曾有一个叫奥托，瓦拉赫的人，中学时，服务为他选了文学之路，可一学期下来，老师给他的评语竟为：‘瓦拉赫很用功，但过分拘泥，这样的人即使有着完美的品德也绝不可能在文学上发挥出来。’无奈，他又改学油画，但这次得到的评语更令人难以接受：“你是绘画艺术方面不可造就之才”。面对如此“笨拙”的学生，大多数老师认为他已成才无望，只有化学老师觉得他做事情一丝不苟，这是做好化学实验应有的品格，建议他试学化学。谁料，瓦拉赫的智慧火花一下子被点燃了，并最终成为了诺贝尔化学奖的得主… 这就是人们广为传颂的“瓦拉赫效应”。承认缺憾，弥补缺陷 缺憾应该成为一种促使自己向上的激励机制，为而不恃一种自甘沉沦的理由，它暗示你在它上面应当作一点努力。 重要的并不在于你做的是什么事，而在于你应当采取某种行动。最不可取的态度是一点事情都不会去做，一味的让自己躲藏在困难的后面，动不动就被困难吓倒，这很任意让自己滋生一种自卑感，久而久之，就什么事情都不敢去做了。 木桶定律：抓最“长”的，不如抓最“短”的 克服人性“短板”，避开成事“暗礁”俗话说“人无完人”，确实，人性是存在许多弱点的，如恶习，自卑，犯错，忧虑，嫉妒等等。根据木桶定律，这些短处往往是限制我们能力的关键。就像木桶一样，一个桶能装多少水，并不是用最长的木板来衡量。而是要靠最短的木板来衡量，木桶装水的容量受到短木板的限制，所以，要想让桐木装更多的说，我们必须加长自己最短的木板。恶习我们时时刻刻都在无意间地培养着习惯，这令我们在很多情况下都要臣服于习惯。而然，好的习惯可我们效力，不好的习惯，尤其是恶习（如果拖沓，酗酒等），会在做事时严重拖我们的腿。所以，我们要学会对自己的习惯分类，对不好的习惯进行改正，完善，一面将成功毁在自己的恶习之中。自卑自卑，可以说是一种性格上的缺陷，表现为对自己能力，品质评价过低。它往往会抹杀我们的自信心，本来有足够的能力去完成学业或者是工作任务，却因怀疑自己而失败，显得处处不行，处处不如别人。所以，做事情要相信自己的能力，要告诉自己“我能行”，“我是最棒的”，那样，才能吧事情办好，走向成功。犯错人们通常不吧犯错看成是一种缺陷，甚至吧“失败乃成功之母”当成自理名言。殊不知，有两种情况下犯错就是一种缺陷。一种是不断地在一个问题上犯错误，另一种是犯错误的频率比别人高。这些错误，或许是因为他们态度问题，或许是他们做事不够细心，没有责任心导致的，但无论那种，都是成功的绊脚石。因此，平时要学会控制自己，改掉马虎大意等不良习惯；犯错后不要找托词和借口，懂得正视错误，并加以改正。忧虑有位作家曾写道，给人们造成精神压力的，并不是今天的现实，而是对昨天所发生事情的悔恨，以及对明天将要发生的事情的忧虑。没错，忧虑不仅会影响我们的心情，而且给我们的工作和学习带来更大的压力。更重要的是，无休止的忧虑并不能解决问题。所以，我们要学会控制自己的情绪，客观地去看待问题，在现实中磨炼自己的性格。妒忌妒忌是人类最普遍，最根深蒂固的感情之一。它的存在，总是令我们不能理智地，积极地做事，于是，常导致事半功倍，甚至劳而无功的结果。因此，无论在生活中，还是在工作中，我们都应平和，宽容地对待他人，客观地看待自己。虚荣每个人都有一点虚荣心，但是过强的虚荣心，使人很容易被赞美之词迷惑，甚至不能自持，很容易被对手打败。所以，我们要控制自己的虚荣，摆脱虚荣，正确地认识自己。贪婪由于太看重眼前的利益，改放弃时不能放弃，结果X成大错，甚至是悔恨终生。总所周知，很多人因太贪钱财等身外之物而毁了大好前程，有时明知是圈套，却因为抵御不住诱惑而落入陷阱。说到底，不是人不聪明，而是白给了自己的贪欲。可见，要成事，先要找对心态，知足才能常乐。 艾森豪威尔法则：分清主次，高效成事 做事分等级，先抓牛鼻子 做事要有科学地安排，要事第一，先抓住牛鼻子，然后在依照轻重缓急逐步执行，一串串，一层层地吧所有的事情拎起来，条理清晰，成效才能最显著，不要眉毛胡子一把抓。 确定事情的顺序 A：必须要做的事情； B：应该做的事情； C：量力而为的事情； D：可委托他人去做的事情； E：应该删除的工作； 每天吧要做的事情写在纸上，按以上5个类别将事情归类： A：需要做； B：应该做； C：做了也不会错； D：可以授权别人去做； E：可以省略不做； 然后根据上面归类，在每天大部分的时间里做A类和B类的事情，即使一天不能完成所有事情，只要将最值得做的事情做完就好。同样的道理，吧自己1~5年内想要做的事情列出来，然后分为A,B,C三类： A：最想做的事情； B：愿意做的事情； C：无所谓的事情； 接着，从A类目标中跳出A1,A2,A3代表最重要，次重要和第三重要的事情。在针对A类目标，抄在另外一张纸上，列出你想要达成这些目标需要做的工作，接着将这份清单在分出A,B,C等级： A：最想做的事情； B：愿意做的事情； C：做了也不会错的事情； 把这些工作放回原来的目标底下，重新调整结构，规划步骤，接着执行。 这些又被称为六步走方法，几挑选目标，设定优先次序，挑选工作，设定优先次序，安排行程，执行。把这些培养成每天的习惯，长期坚持下来并贯彻下去，相信，无数个条理性的成功慢慢积累，将会使你拥有非常成功的人生。 相关定律：","categories":[{"name":"墨菲定律","slug":"墨菲定律","permalink":"http://yoursite.com/categories/墨菲定律/"}],"tags":[{"name":"墨菲定律","slug":"墨菲定律","permalink":"http://yoursite.com/tags/墨菲定律/"}]},{"title":"Hello World","slug":"hello-world","date":"2019-06-01T08:54:31.000Z","updated":"2019-06-01T09:04:30.786Z","comments":true,"path":"2019/06/01/hello-world/","link":"","permalink":"http://yoursite.com/2019/06/01/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"（一）搭建项目并打包JS文件","slug":"webpack4/（一）搭建项目并打包JS文件","date":"2019-05-21T13:01:59.000Z","updated":"2019-06-01T12:18:20.057Z","comments":true,"path":"2019/05/21/webpack4/（一）搭建项目并打包JS文件/","link":"","permalink":"http://yoursite.com/2019/05/21/webpack4/（一）搭建项目并打包JS文件/","excerpt":"","text":"（一）搭建项目并打包JS文件 依赖环境：os:win10node:10.5.0npm:6.1.0webpack:4.29.6webpack-cli:3.2.4每个知识点对应一个demo，clone源码后运行npm install 安装依赖 1.搭建项目并且打包js文件demo1源码地址创建空文件夹，通过运行一下命令进行初始化package.json:npm init npm int用来初始化生成一个新的package.json文件。他会向用户提一系列问题，如果不觉得不需要修改默认配 置，一路回车就可以了。如果使用了-y（代表yes），则跳过了提问阶段，直接生成一个新的package.json文 件。引入webpacknpm i webpack –save-dev还需要webpack-cli，作为一个单独的包引入，如果不装webpack-cli是无法在命令行里面使用webpack的npm i webpack-cli –save-dev该项目webpack的版本如下： 12\"webpack\": \"^4.32.0\",\"webpack-cli\": \"^3.3.2\" 现在打开package.json并且添加一个build（构建）脚本： 尝试运行看看会发生什么：npm run build 在webpack4.0版本中，必须在名为webpack.config.js的配置文件中，通过entry属性定义entry point（入口点），就行这样： 从webpack4.0开始，就不必在在定义entry point（入口点）：它默认为./src/index.js测试这个功能前，首先创建.src/index.js文件 在次运行npm run build试试： 打包成功，并且在当前的根目录中得到打包后的文件夹，也就是build文件夹： 讲查找./src/index.js作为默认入口点。而且，他会在./build/bundle.js中输出模块包，目前代码量小，可以格式化看看效果：至此，打包js结束参考：webpack官网入门","categories":[{"name":"webpack4","slug":"webpack4","permalink":"http://yoursite.com/categories/webpack4/"}],"tags":[{"name":"webpack4","slug":"webpack4","permalink":"http://yoursite.com/tags/webpack4/"}]}]}